Pandas is a Python library used for working with data sets.
It has functions for analyzing, cleaning, exploring, and manipulating data.

In [2]:
import pandas as pd
import numpy as np

In [9]:
##CREATING DATAFRAME
var=pd.DataFrame(np.arange(0,10).reshape(5,2),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2"])

In [10]:
var.head()

      Column1  Column2
Row1        0        1
Row2        2        3
Row3        4        5
Row4        6        7
Row5        8        9

In [5]:
##CREATING DATAFRAME
df1=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])

In [6]:
df1.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [18]:
data = {
  'subject': ["Maths", "English", "Science","History","Computer"],
  'marks': [80, 90,100,88,58 ],
    'grade' :["B","A","A","C","D"]
}

df= pd.DataFrame(data)

print(var)

      Column1  Column2
Row1        0        1
Row2        2        3
Row3        4        5
Row4        6        7
Row5        8        9

##Locate Row:Pandas use the loc attribute to return one or more specified rows

In [12]:
print(df.loc[0])

subject    Maths
marks         80
grade          B
Name: 0, dtype: object

In [13]:
print(df.loc[[0, 1]])

   subject  marks grade
0    Maths     80     B
1  English     90     A

In [14]:
df.iloc[0:2,0:1]

   subject
0    Maths
1  English

In [15]:
df.iloc[:,:]  #ACCESSING ROWS AND COLUM

    subject  marks grade
0     Maths     80     B
1   English     90     A
2   Science    100     A
3   History     88     C
4  Computer     58     D

In [16]:
df.iloc[:,:].values  #CONVERTING DATAFRAME INTO ARRAY

array([['Maths', 80, 'B'],
       ['English', 90, 'A'],
       ['Science', 100, 'A'],
       ['History', 88, 'C'],
       ['Computer', 58, 'D']], dtype=object)

In [17]:
df.isnull().sum()  #check null condition

subject    0
marks      0
grade      0
dtype: int64

In [64]:
mydata = {
  'subject': ["Maths", "English", "Science"],
  'marks': [80, 90,np.nan ],
    'grade' :["B","A","A"]
}

df= pd.DataFrame(mydata)

print(df)

   subject  marks grade
0    Maths   80.0     B
1  English   90.0     A
2  Science    NaN     A

In [65]:
df.isnull().sum()  #check null condition

subject    0
marks      1
grade      0
dtype: int64

In [66]:
 var['marks'].value_counts() #unique value/categorires

80     1
90     1
100    1
88     1
58     1
Name: marks, dtype: int64

In [67]:
var['marks'].unique()

array([ 80,  90, 100,  88,  58], dtype=int64)

In [68]:
var['marks']

0     80
1     90
2    100
3     88
4     58
Name: marks, dtype: int64

In [69]:
var[['subject','marks']]

    subject  marks
0     Maths     80
1   English     90
2   Science    100
3   History     88
4  Computer     58